# Δήλωση και αρχικοποίηση μεταβλητής
count = 0

# Μεταβλητή number: είσοδος αριθμού απο χρήστη
# τη μετατρέπω κατευθείαν σε int
number = int(input("Δώστε το n (2-10000): "))

# Αν ο αριθμός είναι μικρότερος από 2 ή
# Αν είναι μεγαλύτερος απο 10000
# Ζητάμε να μας δώσει ο χρήστης ξανά αριθμό
while number < 2 or number > 10000:
    number = int(input("Δώστε το n (2-10000): "))

# Εκτύπωση αριθμού χωρίς αλλαγή γραμμής
print(number, end="")

# Όσο ο αριθμός δεν είναι 1
while number != 1:
    # Αν είναι άρτιος
    if number % 2 == 0:
        # Διαιρούμε το number με το 2 και το
        # εκχωρούμε στη μεταβλητή number
        number = number // 2
        # Αυξάνουμε το count κατά 1
        count += 1
    # Αν είναι περιττός
    else:
        # Πολλαπλασιάζουμε το number με το 3
        # Και προσθέτουμε 1
        number = (number * 3) + 1
        # Αυξάνουμε το count κατά 1
        count += 1
    # φορματ εκτύπωσης που ζητάει η άσκηση
    print(" -> ", number, end="")

# Εκτύπωση κενής γραμμής
print()

# φορμάτ εκτύπωσης αν έχουμε 1 επανάληψη
if count == 1:
    print(f"{count} επανάληψη")
# εκτύπωση αν έχουμε επανάληψη πάνω απο 1
else:
    print(f"{count} επαναλήψεις")



