# Εκτύπωση στην οθόνη τίτλος του προγράμματος
print("ΤΡΙΓΩΝΟ ΨΗΦΙΩΝ")
# Για οσο είναι αλήθεια
while True:
    # Θα εκτυπώνει το μήνυμα εισαγωγής αριθμού απο 1-9 ή 0 για έξοδο
    number = int(input("Δώστε έναν αριθμό από 1 έως 9, ή 0 για έξοδο: "))
    # Αν είναι 0 έχουμε τερματισμό του προγράμματος
    if number == 0:
        print("Τέλος Προγράμματος")
        break
    # Αν η μεταβλητή number είναι μεγαλύτερη απο 10 ή μικρότερη απο 1
    # Αγνοείται και μας ζητά πάλι να δώσουμε έναν αριθμό απο το 1-9 ή 0 για έξοδο
    if number >= 10 or number < 1:
        continue
    # Εδώ φτάνουμε αν ο αριθμός είναι στα σωστά πλαίσια (1-9)
    # Η επανάληψη ξεκινάει απο το number και μειώνεται κατά 1 κάθε φορά μέχρι να φτάσει στο 1
    for i in range(number, 0, -1):
        print(i * str(i))

