# Δήλωση Αρχικοποίηση μεταβλητών
# Η μεταβλητή για τον αριθμό με τις περισσότερες επαναλήψεις
top_num = 0

# Μεταβλητή που θα έχει τον αριθμό επαναλήψεων
# Αρχικοποίηση στο -1 για να με βοηθήσει στις συγκρίσεις
max_num_times = -1

# Επαναληπτικός βρόχος απο 2 έως 10000
for num in range(2, 10001):
    # Δήλωση μεταβλητής current_num ιση με το num
    current_num = num
    # Μεταβλητή που μετράει επαναλήψεις του αριθμού
    times = 0
    # Όσο ο current_num δεν είναι 1
    while current_num != 1:
        # Αν είναι άρτιος
        if current_num % 2 == 0:
            current_num = current_num // 2
            # Αυξάνουμε το times κατά 1
            times += 1
        # Αν είναι περιττός
        else:
            current_num = (current_num * 3) + 1
            # Αυξάνουμε το times κατά 1
            times += 1
    # Κάνω τη σύγκριση
    if times > max_num_times:
        # Και εκχωρώ στις μεταβλητές τα αποτελέσματα
        max_num_times = times
        top_num = num

# Εκτύπωση αριθμού
print("Ο αριθμός είναι:", top_num)
# Εκτύπωση αριθμού επαναλήψεων
print("Με", max_num_times, "επαναλήψεις")
